In [4]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [5]:
data = pd.Series([0.25, 0.5, 0.75, 1.0])
data

0    0.25
1    0.50
2    0.75
3    1.00
dtype: float64

In [6]:
data.index = ['a', 'b', 'c', 'd']

In [7]:
data

a    0.25
b    0.50
c    0.75
d    1.00
dtype: float64

In [8]:
data['b']

0.5

In [9]:
population_dict = {'California': 38332521, "Texas": 26448193, "New York": 19651127, 'Florida':19552860, 'Illinois': 12882135}

In [10]:
population = pd.Series(population_dict) 
population

California    38332521
Texas         26448193
New York      19651127
Florida       19552860
Illinois      12882135
dtype: int64

In [11]:
population['California']

38332521

In [12]:
population['California':'New York']

California    38332521
Texas         26448193
New York      19651127
dtype: int64

In [13]:
d = {'aa':[1,2], 'bb':[3,4]}

In [14]:
df = pd.DataFrame(data=d)
df

   aa  bb
0   1   3
1   2   4

In [15]:
df2 = pd.DataFrame(np.random.randint(low=0, high=10, size=(5,5)), columns = ['a', 'b', 'c', 'd', 'e'])
df2

   a  b  c  d  e
0  0  4  1  8  0
1  9  4  2  3  2
2  1  6  1  8  7
3  4  1  1  6  6
4  7  0  6  6  6

In [16]:
area_dict={'Texas':695662, 'California':423967, 'New York':141297, 'Florida':170312, 'Illinois':149995}

In [17]:
area = pd.Series(area_dict)
area

Texas         695662
California    423967
New York      141297
Florida       170312
Illinois      149995
dtype: int64

In [18]:
states = pd.DataFrame({'population':population, 'area':area})
states

            population    area
California    38332521  423967
Florida       19552860  170312
Illinois      12882135  149995
New York      19651127  141297
Texas         26448193  695662

In [19]:
dates= pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [20]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2013-01-01  0.049868  0.044637  0.112110 -0.040609
2013-01-02 -0.403224 -0.999288  0.559930  1.386733
2013-01-03 -1.248492  1.950903 -0.405817 -0.283795
2013-01-04 -0.306804 -1.667862  0.026725 -0.530424
2013-01-05  0.050119  0.481262  1.925148 -0.251961
2013-01-06 -1.578361 -0.026880  0.310682  0.990973

In [22]:
df.head()

                   A         B         C         D
2013-01-01  0.049868  0.044637  0.112110 -0.040609
2013-01-02 -0.403224 -0.999288  0.559930  1.386733
2013-01-03 -1.248492  1.950903 -0.405817 -0.283795
2013-01-04 -0.306804 -1.667862  0.026725 -0.530424
2013-01-05  0.050119  0.481262  1.925148 -0.251961

In [23]:
df.tail(3)

                   A         B         C         D
2013-01-04 -0.306804 -1.667862  0.026725 -0.530424
2013-01-05  0.050119  0.481262  1.925148 -0.251961
2013-01-06 -1.578361 -0.026880  0.310682  0.990973

In [24]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [25]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [26]:
df.values

array([[ 0.04986823,  0.04463732,  0.11211004, -0.0406091 ],
       [-0.40322423, -0.99928833,  0.5599305 ,  1.38673262],
       [-1.2484918 ,  1.95090335, -0.40581651, -0.28379521],
       [-0.30680362, -1.66786195,  0.02672451, -0.53042382],
       [ 0.05011893,  0.48126231,  1.92514782, -0.25196109],
       [-1.5783609 , -0.02687952,  0.31068224,  0.99097329]])

In [27]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.572816 -0.036204  0.421463  0.211819
std    0.684539  1.250026  0.803545  0.782671
min   -1.578361 -1.667862 -0.405817 -0.530424
25%   -1.037175 -0.756186  0.048071 -0.275837
50%   -0.355014  0.008879  0.211396 -0.146285
75%   -0.039300  0.372106  0.497618  0.733078
max    0.050119  1.950903  1.925148  1.386733

In [28]:
df.sort_index(axis = 1, ascending = False)

                   D         C         B         A
2013-01-01 -0.040609  0.112110  0.044637  0.049868
2013-01-02  1.386733  0.559930 -0.999288 -0.403224
2013-01-03 -0.283795 -0.405817  1.950903 -1.248492
2013-01-04 -0.530424  0.026725 -1.667862 -0.306804
2013-01-05 -0.251961  1.925148  0.481262  0.050119
2013-01-06  0.990973  0.310682 -0.026880 -1.578361

In [33]:
df.sort_values(by='B')

                   A         B         C         D
2013-01-04 -0.306804 -1.667862  0.026725 -0.530424
2013-01-02 -0.403224 -0.999288  0.559930  1.386733
2013-01-06 -1.578361 -0.026880  0.310682  0.990973
2013-01-01  0.049868  0.044637  0.112110 -0.040609
2013-01-05  0.050119  0.481262  1.925148 -0.251961
2013-01-03 -1.248492  1.950903 -0.405817 -0.283795

In [34]:
df.loc[dates[0]]

A    0.049868
B    0.044637
C    0.112110
D   -0.040609
Name: 2013-01-01 00:00:00, dtype: float64

In [35]:
df.loc[:,['A', 'B']]

                   A         B
2013-01-04 -0.306804 -1.667862
2013-01-02 -0.403224 -0.999288
2013-01-06 -1.578361 -0.026880
2013-01-01  0.049868  0.044637
2013-01-05  0.050119  0.481262
2013-01-03 -1.248492  1.950903

In [37]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-04 -0.306804 -1.667862
2013-01-02 -0.403224 -0.999288
2013-01-03 -1.248492  1.950903

In [40]:
df.iloc[3]

A    0.049868
B    0.044637
C    0.112110
D   -0.040609
Name: 2013-01-01 00:00:00, dtype: float64

In [41]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-01  0.049868  0.044637
2013-01-05  0.050119  0.481262

In [43]:
df[df>0]

                   A         B         C         D
2013-01-04       NaN       NaN  0.026725       NaN
2013-01-02       NaN       NaN  0.559930  1.386733
2013-01-06       NaN       NaN  0.310682  0.990973
2013-01-01  0.049868  0.044637  0.112110       NaN
2013-01-05  0.050119  0.481262  1.925148       NaN
2013-01-03       NaN  1.950903       NaN       NaN

In [44]:
df2 = df.copy()

In [45]:
df2['E']= ['one', 'one', 'two', 'three', 'four', 'three']
df2

                   A         B         C         D      E
2013-01-04 -0.306804 -1.667862  0.026725 -0.530424    one
2013-01-02 -0.403224 -0.999288  0.559930  1.386733    one
2013-01-06 -1.578361 -0.026880  0.310682  0.990973    two
2013-01-01  0.049868  0.044637  0.112110 -0.040609  three
2013-01-05  0.050119  0.481262  1.925148 -0.251961   four
2013-01-03 -1.248492  1.950903 -0.405817 -0.283795  three

In [46]:
df2[df2['E'].isin(['two', 'four'])]

                   A         B         C         D     E
2013-01-06 -1.578361 -0.026880  0.310682  0.990973   two
2013-01-05  0.050119  0.481262  1.925148 -0.251961  four

In [47]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('20130102', periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

In [48]:
df['F']=s1
df

                   A         B         C         D    F
2013-01-04 -0.306804 -1.667862  0.026725 -0.530424  3.0
2013-01-02 -0.403224 -0.999288  0.559930  1.386733  1.0
2013-01-06 -1.578361 -0.026880  0.310682  0.990973  5.0
2013-01-01  0.049868  0.044637  0.112110 -0.040609  NaN
2013-01-05  0.050119  0.481262  1.925148 -0.251961  4.0
2013-01-03 -1.248492  1.950903 -0.405817 -0.283795  2.0

In [49]:
df.at[dates[0], 'A']=0
df

                   A         B         C         D    F
2013-01-04 -0.306804 -1.667862  0.026725 -0.530424  3.0
2013-01-02 -0.403224 -0.999288  0.559930  1.386733  1.0
2013-01-06 -1.578361 -0.026880  0.310682  0.990973  5.0
2013-01-01  0.000000  0.044637  0.112110 -0.040609  NaN
2013-01-05  0.050119  0.481262  1.925148 -0.251961  4.0
2013-01-03 -1.248492  1.950903 -0.405817 -0.283795  2.0

In [50]:
df.iat[0,1]=0
df

                   A         B         C         D    F
2013-01-04 -0.306804  0.000000  0.026725 -0.530424  3.0
2013-01-02 -0.403224 -0.999288  0.559930  1.386733  1.0
2013-01-06 -1.578361 -0.026880  0.310682  0.990973  5.0
2013-01-01  0.000000  0.044637  0.112110 -0.040609  NaN
2013-01-05  0.050119  0.481262  1.925148 -0.251961  4.0
2013-01-03 -1.248492  1.950903 -0.405817 -0.283795  2.0

In [51]:
df.loc[:, 'D']=np.array([5]*len(df))
df

                   A         B         C  D    F
2013-01-04 -0.306804  0.000000  0.026725  5  3.0
2013-01-02 -0.403224 -0.999288  0.559930  5  1.0
2013-01-06 -1.578361 -0.026880  0.310682  5  5.0
2013-01-01  0.000000  0.044637  0.112110  5  NaN
2013-01-05  0.050119  0.481262  1.925148  5  4.0
2013-01-03 -1.248492  1.950903 -0.405817  5  2.0

In [52]:
df.mean()

A   -0.581127
B    0.241773
C    0.421463
D    5.000000
F    3.000000
dtype: float64

In [53]:
df.mean(axis=1)

2013-01-04    1.543984
2013-01-02    1.031484
2013-01-06    1.741088
2013-01-01    1.289187
2013-01-05    2.291306
2013-01-03    1.459319
dtype: float64

In [54]:
df.apply(np.cumsum)

                   A         B         C   D     F
2013-01-04 -0.306804  0.000000  0.026725   5   3.0
2013-01-02 -0.710028 -0.999288  0.586655  10   4.0
2013-01-06 -2.288389 -1.026168  0.897337  15   9.0
2013-01-01 -2.288389 -0.981531  1.009447  20   NaN
2013-01-05 -2.238270 -0.500268  2.934595  25  13.0
2013-01-03 -3.486762  1.450635  2.528779  30  15.0

In [55]:
df.apply(lambda x: x.max()-x.min())

A    1.628480
B    2.950192
C    2.330964
D    0.000000
F    4.000000
dtype: float64

In [56]:
df['A'].value_counts()

-1.248492    1
-0.306804    1
 0.050119    1
-0.403224    1
-1.578361    1
 0.000000    1
Name: A, dtype: int64

In [57]:
left = pd.DataFrame({'key':['foo','bar'], 'lval':[1,2]})

In [58]:
right = pd.DataFrame({'key':['foo', 'bar'], 'rval':[4,5]})

In [59]:
left

   key  lval
0  foo     1
1  bar     2

In [60]:
right

   key  rval
0  foo     4
1  bar     5

In [61]:
pd.merge(left, right, on='key')

   key  lval  rval
0  foo     1     4
1  bar     2     5

In [62]:
df = pd.DataFrame(np.random.randn(8,4), columns=['A', 'B', 'C', 'D'])
df

          A         B         C         D
0 -0.250106 -0.620447 -0.746796 -0.386616
1 -0.046200  0.906032  1.353557 -1.568738
2 -0.100575  0.005996  0.904199 -1.808546
3  1.217426 -1.141686 -0.475654 -1.168492
4 -1.259137 -2.140752  2.438552 -1.106800
5  0.022341 -0.864267 -0.756111  0.184867
6  2.060640  0.697037  0.001916  0.171537
7  0.838097  0.219163  0.437961  0.947257

In [64]:
s = df.iloc[3]

In [66]:
df.append(s, ignore_index=True)

          A         B         C         D
0 -0.250106 -0.620447 -0.746796 -0.386616
1 -0.046200  0.906032  1.353557 -1.568738
2 -0.100575  0.005996  0.904199 -1.808546
3  1.217426 -1.141686 -0.475654 -1.168492
4 -1.259137 -2.140752  2.438552 -1.106800
5  0.022341 -0.864267 -0.756111  0.184867
6  2.060640  0.697037  0.001916  0.171537
7  0.838097  0.219163  0.437961  0.947257
8  1.217426 -1.141686 -0.475654 -1.168492

In [67]:
df = pd.DataFrame({'A':['foo','bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'bar'], 
                'B':['one', 'one', 'two', 'three', 'two', 'two', 'one', 'three'], 
                   'C':np.random.randn(8), 
                   'D':np.random.randn(8)})

In [68]:
df

     A      B         C         D
0  foo    one  0.130962 -0.371997
1  bar    one  1.362116  0.143960
2  foo    two -0.806970  0.156878
3  bar  three  0.184917  1.810175
4  foo    two  0.195802 -0.096479
5  bar    two  2.004463 -0.626293
6  foo    one -1.158406  0.419404
7  bar  three  0.689243 -0.370720

In [69]:
df.groupby('A')

In [70]:
df.groupby('A').sum()

            C         D
A
bar  4.240738  0.957121
foo -1.638613  0.107806

In [71]:
df.groupby(['A','B']).sum()

                  C         D
A   B
bar one    1.362116  0.143960
    three  0.874160  1.439455
    two    2.004463 -0.626293
foo one   -1.027444  0.047406
    two   -0.611169  0.060399

In [81]:
df = pd.read_csv('fortune1000.csv')

FileNotFoundError: [Errno 2] File fortune1000.csv does not exist: 'fortune1000.csv'

In [82]:
df.head()

     A      B         C         D
0  foo    one  0.051180  1.624620
1  bar    one  0.693901 -0.290661
2  foo    two  1.026737 -0.005958
3  bar  three -0.518133  0.777722
4  foo    two -0.184031 -0.206399